cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'mongodb/brew'

brew 'ack'
brew 'awscli'
brew 'wget'
brew 'mackup'
brew 'mas'
brew 'kubectl'
brew 'argocd'
brew 'kubeseal'
brew 'watch'
brew 'jq'
brew 'mongodb-community'
brew 'chruby'
brew 'ruby-install'
brew 'python'

cask 'hyper'
cask 'postman'
cask 'signal'
cask 'visual-studio-code'
cask 'rectangle'
cask 'runjs'
cask 'docker'
cask 'shottr'
cask 'raycast'

mas "1Password 7", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "ColorSlurp", id: 1287239339
mas "Dato", id: 1470584107
mas "Hand Mirror", id: 1502839586
mas "Hidden Bar", id: 1452453066
# download from website
# mas "iStat Menus", id: 1319778037
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Reeder", id: 1529448980
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "SnippetsLab", id: 1006087419
mas "WireGuard", id: 1451685025
