cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'wget'
brew 'mackup'
brew 'mas'
brew 'kubectl'
brew 'argocd'
brew 'kubeseal'
brew 'watch'
brew 'jq'

cask 'hyper'
cask 'postman'
cask 'signal'
cask 'visual-studio-code'
cask 'spectacle'
cask 'runjs'
cask 'docker'

mas "1Password 7", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "ColorSlurp", id: 1287239339
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "SnipperApp 2", id: 1469182443
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
